Revit 2027 API
ScheduleSortGroupField.ShowFooter Property
 Indicates if a footer row should be displayed after each group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowFooter { get; set; }
Public Property ShowFooter As Boolean
	Get
	Set
public:
property bool ShowFooter {
	bool get ();
	void set (bool value);
}
member ShowFooter : bool with get, set
Property Value
Boolean
 True if a footer row should be displayed, false otherwise.
Remarks
 The footer row displays totals of each field for which totals are enabled. It can also optionally display a title (see ShowFooterTitle) and a count of elements (see ShowFooterCount).
See Also
Reference
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace